app/Models/Kabid/M_LogbookKabid.php

    public function getDetailPenempatan($id_penempatan)
    {
        return $this->db->table('t_penempatan_magang p')
            ->select('
                p.id_penempatan_magang, p.status_penempatan,
                ps.id_persetujuan_magang, pm.id_permohonan_magang,
                jp.jenis_permohonan, pm.tgl_mulai, pm.tgl_selesai,
                ip.instansi_pendidikan,
                f.fakultas,
                pr.prodi,
                im.semester, im.angkatan_tahun, im.tahun_akademik, im.jenjang_pendidikan,
                m.nik, m.nim, m.nama_mahasiswa, m.email, m.no_telp,
                m.jenis_kelamin, m.tgl_lahir,
                m.alamat, m.rt, m.rw, m.kelurahan, m.kecamatan, m.provinsi
            ')
            ->join('t_persetujuan_magang ps', 'ps.id_persetujuan_magang = p.id_persetujuan_magang')
            ->join('t_permohonan_magang pm', 'pm.id_permohonan_magang = ps.id_permohonan_magang')
            ->join('m_mahasiswa m', 'm.id_mahasiswa = pm.id_mahasiswa')
            ->join('t_instansi_mahasiswa im', 'im.id_instansi_mahasiswa = pm.id_instansi_mahasiswa')
            ->join('m_instansi_pendidikan ip', 'ip.id_instansi_pendidikan = im.id_instansi_pendidikan')
            ->join('m_fakultas f', 'f.id_fakultas = im.id_fakultas', 'left')
            ->join('m_prodi pr', 'pr.id_prodi = im.id_prodi')
            ->join('m_jenis_permohonan jp', 'jp.id_jenis_permohonan = pm.id_jenis_permohonan', 'left')
            ->where('p.id_penempatan_magang', $id_penempatan)
            ->get()->getRow();
---
SELECT `p`.`id_penempatan_magang`, `p`.`status_penempatan`, `ps`.`id_persetujuan_magang`, `pm`.`id_permohonan_magang`, `jp`.`jenis_permohonan`, `pm`.`tgl_mulai`, `pm`.`tgl_selesai`, `ip`.`instansi_pendidikan`, `f`.`fakultas`, `pr`.`prodi`, `im`.`semester`, `im`.`angkatan_tahun`, `im`.`tahun_akademik`, `im`.`jenjang_pendidikan`, `m`.`nik`, `m`.`nim`, `m`.`nama_mahasiswa`, `m`.`email`, `m`.`no_telp`, `m`.`jenis_kelamin`, `m`.`tgl_lahir`, `m`.`alamat`, `m`.`rt`, `m`.`rw`, `m`.`kelurahan`, `m`.`kecamatan`, `m`.`provinsi`
FROM `t_penempatan_magang` `p`
JOIN `t_persetujuan_magang` `ps` ON `ps`.`id_persetujuan_magang` = `p`.`id_persetujuan_magang`
JOIN `t_permohonan_magang` `pm` ON `pm`.`id_permohonan_magang` = `ps`.`id_permohonan_magang`
JOIN `m_mahasiswa` `m` ON `m`.`id_mahasiswa` = `pm`.`id_mahasiswa`
JOIN `t_instansi_mahasiswa` `im` ON `im`.`id_instansi_mahasiswa` = `pm`.`id_instansi_mahasiswa`
JOIN `m_instansi_pendidikan` `ip` ON `ip`.`id_instansi_pendidikan` = `im`.`id_instansi_pendidikan`
LEFT JOIN `m_fakultas` `f` ON `f`.`id_fakultas` = `im`.`id_fakultas`
JOIN `m_prodi` `pr` ON `pr`.`id_prodi` = `im`.`id_prodi`
LEFT JOIN `m_jenis_permohonan` `jp` ON `jp`.`id_jenis_permohonan` = `pm`.`id_jenis_permohonan`
WHERE `p`.`id_penempatan_magang` = '20'