app/Models/Kabid/M_LogbookKabid.php

    public function getActiveMahasiswa($id_bidang, $search = null, $jenis_permohonan = null, $status_filter = null)
    {
        $builder = $this->db->table('t_penempatan_magang p')
            ->select('p.id_penempatan_magang, p.status_penempatan, m.nama_mahasiswa, m.nim, ip.instansi_pendidikan, pr.prodi, pm.tgl_mulai, pm.tgl_selesai, jp.jenis_permohonan')
            ->join('t_persetujuan_magang ps', 'ps.id_persetujuan_magang = p.id_persetujuan_magang')
            ->join('t_permohonan_magang pm', 'pm.id_permohonan_magang = ps.id_permohonan_magang')
            ->join('m_mahasiswa m', 'm.id_mahasiswa = pm.id_mahasiswa')
            ->join('t_instansi_mahasiswa im', 'im.id_instansi_mahasiswa = pm.id_instansi_mahasiswa')
            ->join('m_instansi_pendidikan ip', 'ip.id_instansi_pendidikan = im.id_instansi_pendidikan')
            ->join('m_prodi pr', 'pr.id_prodi = im.id_prodi')
            ->join('m_jenis_permohonan jp', 'jp.id_jenis_permohonan = pm.id_jenis_permohonan', 'left')
            ->where('p.id_bidang', $id_bidang)
            ->whereIn('p.status_penempatan', ['BERJALAN', 'SELESAI']);

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('m.nama_mahasiswa', $search)
                    ->orLike('m.nim', $search)
                    ->groupEnd();
        }

        if (!empty($jenis_permohonan)) {
            $builder->where('pm.id_jenis_permohonan', $jenis_permohonan);
        }

        if (!empty($status_filter) && in_array($status_filter, ['BERJALAN', 'SELESAI'])) {
            $builder->where('p.status_penempatan', $status_filter);
        }

        return $builder->orderBy('p.status_penempatan', 'ASC')
                        ->orderBy('pm.tgl_mulai', 'DESC')
                        ->get()->getResult();
---
SELECT `p`.`id_penempatan_magang`, `p`.`status_penempatan`, `m`.`nama_mahasiswa`, `m`.`nim`, `ip`.`instansi_pendidikan`, `pr`.`prodi`, `pm`.`tgl_mulai`, `pm`.`tgl_selesai`, `jp`.`jenis_permohonan`
FROM `t_penempatan_magang` `p`
JOIN `t_persetujuan_magang` `ps` ON `ps`.`id_persetujuan_magang` = `p`.`id_persetujuan_magang`
JOIN `t_permohonan_magang` `pm` ON `pm`.`id_permohonan_magang` = `ps`.`id_permohonan_magang`
JOIN `m_mahasiswa` `m` ON `m`.`id_mahasiswa` = `pm`.`id_mahasiswa`
JOIN `t_instansi_mahasiswa` `im` ON `im`.`id_instansi_mahasiswa` = `pm`.`id_instansi_mahasiswa`
JOIN `m_instansi_pendidikan` `ip` ON `ip`.`id_instansi_pendidikan` = `im`.`id_instansi_pendidikan`
JOIN `m_prodi` `pr` ON `pr`.`id_prodi` = `im`.`id_prodi`
LEFT JOIN `m_jenis_permohonan` `jp` ON `jp`.`id_jenis_permohonan` = `pm`.`id_jenis_permohonan`
WHERE `p`.`id_bidang` = '5'
AND `p`.`status_penempatan` IN ('BERJALAN','SELESAI','DIBATALKAN')
AND `p`.`status_penempatan` = 'SELESAI'
ORDER BY `p`.`status_penempatan` ASC, `pm`.`tgl_mulai` DESC