app/Models/Kabid/M_Penempatan.php

    public function countPenempatanMenunggu($id_bidang = null)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('t_penempatan_magang');
        $builder->where('status_penempatan', '0');

        if ($id_bidang !== null) {
            $builder->where('id_bidang', $id_bidang);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_penempatan_magang`
WHERE `status_penempatan` = '0'
AND `id_bidang` = '5'