app/Controllers/Kabid/C_DashboardKabid.php

SELECT *
FROM `c_user_pegawai`
WHERE `id_user_pegawai` = '5'
SELECT COUNT(*) AS `numrows`
FROM `t_penempatan_magang`
WHERE `status_penempatan` = 'BERJALAN'
AND `id_bidang` = '5'
SELECT COUNT(*) AS `numrows`
FROM `t_penempatan_magang`
WHERE `status_penempatan` = 'SELESAI'
AND `id_bidang` = '5'
---
    public function index(): string
    {
        $db = \Config\Database::connect();

        // Ambil id_bidang user yang login
        $id_user = session('id_user_pegawai');
        $user = $db->table('c_user_pegawai')
            ->where('id_user_pegawai', $id_user)
            ->get()
            ->getRow();

        $id_bidang = $user->id_bidang ?? null;

        // Hitung penempatan menunggu
        $total_menunggu = $this->penempatanModel->countPenempatanMenunggu($id_bidang);

        // Hitung penempatan berjalan
        $total_berjalan = $db->table('t_penempatan_magang')
            ->where('status_penempatan', 'BERJALAN');
        if ($id_bidang) {
            $total_berjalan->where('id_bidang', $id_bidang);
        }
        $total_berjalan = $total_berjalan->countAllResults();

        // Hitung penempatan selesai
        $total_selesai = $db->table('t_penempatan_magang')
            ->where('status_penempatan', 'SELESAI');
        if ($id_bidang) {
            $total_selesai->where('id_bidang', $id_bidang);
        }
        $total_selesai = $total_selesai->countAllResults();

SELECT *
FROM `m_bidang`
WHERE `id_bidang` = '5'
---
        // Ambil nama bidang
        $bidang_info = null;
        if ($id_bidang) {
            $bidang_info = $db->table('m_bidang')
                ->where('id_bidang', $id_bidang)
                ->get()
                ->getRow();

SELECT *
FROM `m_kuota`
WHERE `id_bidang` = '5'
---

        // Hitung kuota bidang
        $total_kuota = 0;
        $kuotaRow = $db->table('m_kuota')->where('id_bidang', $id_bidang)->get()->getRow();

SELECT `l`.`id_logbook_magang`, `l`.`tgl_logbook`, `l`.`logbook_magang`, `m`.`nama_mahasiswa`
FROM `t_logbook_magang` `l`
JOIN `t_penempatan_magang` `p` ON `p`.`id_penempatan_magang` = `l`.`id_penempatan_magang`
JOIN `t_persetujuan_magang` `ps` ON `ps`.`id_persetujuan_magang` = `p`.`id_persetujuan_magang`
JOIN `t_permohonan_magang` `pm` ON `pm`.`id_permohonan_magang` = `ps`.`id_permohonan_magang`
JOIN `m_mahasiswa` `m` ON `m`.`id_mahasiswa` = `pm`.`id_mahasiswa`
WHERE `p`.`id_bidang` = '5'
AND `l`.`disetujui_oleh` IS NULL
ORDER BY `l`.`tgl_logbook` ASC
 LIMIT 5
---
        $kuota_label = $sisa_kuota <= 0 ? '🔴 Kapasitas Penuh' : '🟢 Kuota Masih Tersedia';

        // Ambil daftar logbook menunggu persetujuan
        $logbook_list = $db->table('t_logbook_magang l')
            ->select('l.id_logbook_magang, l.tgl_logbook, l.logbook_magang, m.nama_mahasiswa')
            ->join('t_penempatan_magang p', 'p.id_penempatan_magang = l.id_penempatan_magang')
            ->join('t_persetujuan_magang ps', 'ps.id_persetujuan_magang = p.id_persetujuan_magang')
            ->join('t_permohonan_magang pm', 'pm.id_permohonan_magang = ps.id_permohonan_magang')
            ->join('m_mahasiswa m', 'm.id_mahasiswa = pm.id_mahasiswa')
            ->where('p.id_bidang', $id_bidang)
            ->where('l.disetujui_oleh', null)
            ->orderBy('l.tgl_logbook', 'ASC') // yang terlama dulu
            ->limit(5)
            ->get()->getResult();