app/Controllers/Kabid/C_DisposisiMasuk.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Ambil id_bidang user yang login
        $id_user = session('id_user_pegawai');
        $user = $db->table('c_user_pegawai')
            ->where('id_user_pegawai', $id_user)
            ->get()
            ->getRow();
---
SELECT *
FROM `c_user_pegawai`
WHERE `id_user_pegawai` = '5'