app/Controllers/Kabid/C_LogbookKabid.php

SELECT `f`.`nama_file`, `f`.`path_file`, `mp`.`id_file`
FROM `t_file_permohonan_magang` `f`
LEFT JOIN `m_file_permohonan` `mp` ON `mp`.`id_file_permohonan` = `f`.`id_file_permohonan`
WHERE `f`.`id_permohonan_magang` = '45'
SELECT `f`.`id_file_selesai_magang`, `f`.`nama_file`, `f`.`path_file`, `mf`.`nama_file` as `nama_file_master`
FROM `t_file_proses_magang` `f`
LEFT JOIN `m_file` `mf` ON `mf`.`id_file` = `f`.`id_file`
WHERE `f`.`id_persetujuan_magang` = '35'
---
    public function riwayatSelesai()
    {
        if ($this->request->isAJAX() && $this->request->getGet('action') === 'detail' && $this->request->getGet('id')) {
            $id_penempatan = $this->request->getGet('id');
            $detail = $this->logbookModel->getDetailPenempatan($id_penempatan);

            if (!$detail) {
                return $this->response->setJSON(['status' => 'error', 'message' => 'Data mahasiswa tidak ditemukan.']);
            }

            $db = \Config\Database::connect();
            $originalFiles = $db->table('t_file_permohonan_magang f')
                ->select('f.nama_file, f.path_file, mp.id_file')
                ->join('m_file_permohonan mp', 'mp.id_file_permohonan = f.id_file_permohonan', 'left')
                ->where('f.id_permohonan_magang', $detail->id_permohonan_magang)
                ->get()
                ->getResult();

            $finalFiles = $db->table('t_file_proses_magang f')
                ->select('f.id_file_selesai_magang, f.nama_file, f.path_file, mf.nama_file as nama_file_master')
                ->join('m_file mf', 'mf.id_file = f.id_file', 'left')
                ->where('f.id_persetujuan_magang', $detail->id_persetujuan_magang)
                ->get()
                ->getResult();

SELECT *
FROM `m_jenis_permohonan`
---
            'title'       => 'Riwayat Disposisi Magang',
            'active_menu' => 'riwayat_selesai',
            'mahasiswa'   => $this->logbookModel->getActiveMahasiswa($id_bidang, null, null, 'SELESAI'),
            'list_jenis'  => $db->table('m_jenis_permohonan')->get()->getResultArray()