app/Controllers/AuthController.php

SELECT *
FROM `c_user_pegawai`
WHERE `nip` = '87654324'
---
        $password  = $this->request->getPost('password');
        $db        = \Config\Database::connect();

        $userPegawai = $db->table('c_user_pegawai')->where('nip', $inputData)->get()->getRowArray();

SELECT *
FROM `c_user_group`
WHERE `id` = '3'
---
                    'isLoggedIn'      => true
                ];

                $group = $db->table('c_user_group')->where('id', $userPegawai['id_user_group'])->get()->getRowArray();