app/Models/Sekretariat/M_Disposisi.php

UPDATE `t_persetujuan_magang` SET `disposisi` = '1', `id_bidang` = '2', `updated_by` = '2', `updated_at` = '2026-07-06 02:53:22', `tgl_persetujuan` = '2026-07-06 02:53:22'
WHERE `id_persetujuan_magang` = '1'
---
    public function simpanDisposisi($id_persetujuan, $data)
    {
        $db = \Config\Database::connect();

        // 1. Update t_persetujuan_magang dengan data disposisi
        $result = $db->table('t_persetujuan_magang')
            ->where('id_persetujuan_magang', $id_persetujuan)
            ->update([
                'disposisi'       => '1',
                'id_bidang'       => $data['id_bidang'],
                'updated_by'      => $data['updated_by'],
                'updated_at'      => date('Y-m-d H:i:s'),
                'tgl_persetujuan' => date('Y-m-d H:i:s'),
            ]);